Revit 2017 API
RevitLinkLoadResult.GetNestedLinkLoadResults Method
 Gets the results for this link's nested links.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
public IDictionary<string, RevitLinkLoadResult> GetNestedLinkLoadResults()
Visual Basic
Public Function GetNestedLinkLoadResults As IDictionary(Of String, RevitLinkLoadResult)
Visual C++
public:
IDictionary<String^, RevitLinkLoadResult^>^ GetNestedLinkLoadResults()
Return Value
A map from nested link paths to the load results for that nested link.
For links from external servers, the "path" will be the display name of the link.
See Also
RevitLinkLoadResult Class
Autodesk.Revit.DB Namespace